Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh3808-v3.tmx
Source language: bo
Languages: en

source: །བློ་གྲོས་རྒྱ་མཚོ་འདི་ལྟ་སྟེ་དཔེར་ན་ཚོང་དཔོན་ཁྱིམ་བདག་ཅིག་ལ་བུ་སྡུག་པ་ཕངས་པ་ཡིད་དུ་འོང་བ་དང་། ལྟ་བ་དང་མཐུན་པ་གཅིག་པུ་ཞིག་ཡོད་པར་གྱུར་པ་ཁྱེའུ་དེ་ཡང་བྱིས་པར་གྱུར་པས་གར་བྱེད་པ་ལས་ཕྱི་ས་ཁུང་བཙོག་པ་ཞིག་ཏུ་ལྷུང་བ་དང་།
en: As an illustration, suppose, Sāgaramati, that a businessman householder has only one son, and this son, much valued, loved, a delight, and a natural joy to behold becomes a toddler, gets up to something or other, and falls into a filthy cesspool.

source: དེ་ནས་ཁྱེའུ་དེའི་མ་དང་མཛའ་བཤེས་དང་ཉེ་དུ་དག་གིས་ཁྱེའུ་དེ་ཕྱི་ས་ཁུང་བཙོག་པར་ལྷུང་བར་མཐོང་ངོ་།
en: His mother and close and distant relatives then see the child has fallen into the filthy pit.

source: །མཐོང་ནས་ཀྱང་ཤུགས་ཕབ་སྟེ་མྱ་ངན་བྱེད་ཅིང་སྨྲེ་སྔགས་འདོན་གྱིས་ཕྱི་ས་ཁུང་བཙོག་པ་དེར་ཞུགས་ཏེ་བུ་གཅིག་པ་དེ་མི་འབྱིན་ཏོ།
en: They see him and feel a surge of adrenalin, are tormented and scream, but still do not dive into the cesspool and get the son out.

source: །དེ་ནས་ཁྱེའུ་དེའི་ཕ་འོངས་ཏེ། དེས་བུ་གཅིག་པ་ཕྱི་ས་ཁུང་བཙོག་པར་ལྷུང་བ་དེ་མཐོང་ལ།
en: Then the boy’s father arrives and sees his only son fallen into this filthy cesspool.

source: མཐོང་ནས་ཀྱང་བུ་གཅིག་པ་ལ་བསམ་པ་ཐག་པ་ནས་བྱམས་ཤིང་རྗེས་སུ་ཆགས་པས་མི་སྨོད་པར་མྱུར་དུ་སྐྱེན་པར་ལ་གོར་དུ་ཕྱི་ས་ཁུང་བཙོག་པ་དེར་ཞུགས་ཏེ།
en: As soon as he sees his only son his love and attachment are so intense he immediately feels no sense of repulsion, dives into the filthy cesspool, and gets him out. “

source: བུ་གཅིག་པ་ཕྱུང་བ་འདི་ལྟ་བུ་འདི་ནི་བློ་གྲོས་རྒྱ་མཚོ་ཇི་ཙམ་དུ་དོན་ཤེས་པར་བྱ་བའི་ཕྱིར་དཔེར་བྱས་པ་ཡིན་ནོ།
en: This, Sāgaramati, is the analogy I have given so you will understand the meaning.

source: །འདིར་དོན་དུ་ལྟ་བ་གང་ཞེ་ན།
en: And what should you see as the meaning here?

source: བློ་གྲོས་རྒྱ་མཚོ་ཕྱི་ས་ཁུང་བཙོག་པ་ཞེས་བྱ་བ་དེ་ནི་ཁམས་གསུམ་གྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སོ། །བུ་གཅིག་པ་ཞེས་བྱ་བ་དེ་ནི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཏེ། དེ་དག་ལ་བྱང་ཆུབ་སེམས་དཔའ་བུ་གཅིག་པ་ལྟར་འདུ་ཤེས་སོ། །མ་དང་མཛའ་བཤེས་དང་ཉེ་དུ་ཞེས་བྱ་བ་དེ་ནི་ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་གང་ཟག་རྣམས་ཀྱི་ཚིག་{བླ་དགས་,བླ་དྭགས་}ཏེ། དེ་དག་ནི་འཁོར་བར་ལྷུང་བའི་སེམས་ཅན་རྣམས་མཐོང་ན་མྱ་ངན་བྱེད་ཅིང་སྨྲེ་སྔགས་འདོན་གྱི་འབྱིན་པར་མི་ནུས་སོ། །ཚོང་དཔོན་ཁྱིམ་བདག་ཅེས་བྱ་བ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ཚིག་{བླ་དགས་,བླ་དྭགས་}སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུ་སྟེ།
en: Sāgaramati, ‘cesspool’ is a word for the three realms; ‘only son’ words for all beings (bodhisattvas see all beings as an only son); ‘mother and close and distant relatives’ words for persons in the Śrāvaka and Pratyekabuddha Vehicles (when they see beings fallen into saṃsāra they are tormented and scream but do not dare to get them out); and ‘businessman householder’ words for the bodhisattvas.”

source: དགེ་བའི་རྩ་བ་རྣམ་པར་སྨིན་པའི་བདག་ཉིད་དུ་ཡོངས་སུ་བསྒྱུར་བ་དེ་དག་མ་རིག་པའི་བག་ཆགས་ཀྱི་རྐྱེན་གྱི་དབང་གིས་རྒྱས་པར་གྱུར་ན་ལུས་འགྲུབ་པའི་རྒྱུར་འགྱུར་རོ། །ཡང་མདོ་ལས་འདི་སྐད་དུ། བཅོམ་ལྡན་འདས་འདི་ལྟ་སྟེ་དཔེར་ན། ཉེ་བར་ལེན་པའི་རྐྱེན་དང་།
en: When those wholesome roots that have been entirely changed into their ripened form flourish, through the power of the residual impressions left by ignorance as condition, they become the cause for producing a body.

source: ཟག་པ་དང་བཅས་པའི་ལས་ཀྱི་རྒྱུ་ལས་སྲིད་པ་གསུམ་འབྱུང་བར་འགྱུར་ཏེ། བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་མ་རིག་པའི་བག་ཆགས་ཀྱི་སའི་རྐྱེན་དང་། ཟག་པ་མ་མཆིས་པའི་ལས་ཀྱི་རྒྱུ་ལས་དགྲ་བཅོམ་པ་རྣམས་དང་། རང་སངས་རྒྱས་རྣམས་དང་། དབང་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡིད་འབྱུང་བའི་ལུས་གསུམ་དུ་འགྱུར་རོ་ཞེས་གསུངས་པ་ལྟ་བུའོ།
en: As a sūtra also says: Lord, just as appropriation is the condition and karma with outflows the cause of the three suffering existences, so too, Lord, the level of residual impressions left by ignorance is the condition, and karma without outflows the cause for the three mental bodies of worthy ones, pratyekabuddhas, and bodhisattvas who have attained mastery.

source: །ད་ནི་བརྗོད་པར་བྱ་སྟེ།
en: Now I will discuss this.

source: ཅི་ལུས་དེ་འཇིག་རྟེན་འདི་པར་བགྲང་ངམ། འོན་ཏེ་འཇིག་རྟེན་ཕ་རོལ་པར་བགྲང་།
en: Question: Is this body counted as being in this world or in another world?

source: ཅི་འདོད་པའི་ཁམས་སམ། གཟུགས་ཀྱི་ཁམས་སམ། གཟུགས་མེད་པའི་ཁམས་སུ་བགྲང་ཞེ་ན། འགྲོ་བའམ།
en: Is it counted as being in the desire, form, or formless realm?

source: སྐྱེ་གནས་སམ། སྐྱེ་བའམ། སྲིད་པའམ། འཇིག་རྟེན་གང་དུ་འང་མི་བགྲང་ངོ་།
en: It is not counted as a form of life, birthplace, birth, suffering existence, or world.

source: །འོ་ན་ལུས་མངོན་པར་གྲུབ་པ་དེ་ཇི་འདྲ་བ་ཞིག་ཅེ་ན།
en: Question: Well then, what sort of body is this production?

source: ཡིད་ལས་བྱུང་བ་སྟེ།
en: It is mental.

source: ཡིད་ལས་བྱུང་བའི་སྤྲུལ་པ་ལྟ་བུར་ལྟའི་སྤྲུལ་པ་ཉིད་ནི་མ་ཡིན་ནོ།
en: But you should view it as similar to a mental magical creation, not as an actual magical creation.

source: །ཡང་སྲིད་པ་ཞེས་བྱ་བ་ནི་འཆི་འཕོ་དང་སྐྱེ་བའི་དབང་གིས་བཏགས་པར་བརྗོད་པ་སྟེ།
en: It is designated another existence based on dying and being reborn.

source: དབང་ཐོབ་པ་རྣམས་ནི་སེམས་ཅན་གྱི་དོན་དུ་འགྱུར་བ་ཡོད་ན། སྐྱེ་གནས་དང་འགྲོ་བ་དེ་དང་དེ་དག་ཏུ་སྣང་བར་འགྱུར་ལ། སེམས་ཅན་གྱི་དོན་དུ་འགྱུར་བ་མེད་ན་ནི་བདག་ཉིད་མི་སྣང་བར་འགྱུར་ཏེ།
en: Those who have attained mastery appear in those different birthplaces and migrations if it will be beneficial for beings, but they do not appear to beings if there is no benefit.

source: འཆི་འཕོ་དང་སྐྱེ་བ་ཡང་དེ་ཉིད་ཡིན་ལ། ལུས་དེ་ཉིད་ཟག་པ་མེད་པའི་དགེ་བའི་རྩ་བའི་རྣམ་པར་སྨིན་པ་ཡིན་པའི་ཕྱིར་འདུས་བྱས་ཡིན་ཏེ། འཁོར་བ་ཞེས་ཀྱང་བྱའོ། །ཟག་པ་དང་བཅས་པའི་ལས་དང་། ཉོན་མོངས་པས་མངོན་པར་འདུས་མ་བྱས་པའི་ཕྱིར།
en: Their dying and being reborn is also just like that; and since this body is the ripening of wholesome roots without outflows, and hence a compounded phenomenon, it is also saṃsāra; it is also an uncompounded phenomenon because it is not formed from karma with outflows and afflictions.

source: འདུས་མ་བྱས་པ་ཞེས་ཀྱང་བྱ་སྟེ། དེ་ཉིད་ལ་མྱ་ངན་ལས་འདས་པ་ཞེས་ཀྱང་བྱའོ།
en: Just that is also nirvāṇa.

source: །འདི་ལྟར་བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་འདུས་བྱས་དང་འདུས་མ་བྱས་པའི་འཁོར་བ་ཡང་མཆིས་ལ། འདུས་བྱས་དང་འདུས་མ་བྱས་པའི་མྱ་ངན་ལས་འདས་པ་ཡང་མཆིས་སོ་ཞེས་འབྱུང་བ་ལྟ་བུ་སྟེ།
en: Thus, as the Lord says: “Therefore, saṃsāra is both compounded and uncompounded; nirvāṇa too is both compounded and uncompounded.”

source: དེ་ལྟར་ན་དེ་བཞིན་གཤེགས་པ་ཐབས་ལ་མཁས་པས་ཉན་ཐོས་འདི་དག་སྔར་དགྲ་བཅོམ་པར་མཛད་པས་ཉོན་མོངས་པ་སྤངས་ནས་དེའི་འོག་ཏུ་བྱང་ཆུབ་ཀྱི་ལམ་ལ་སྦྱོར་བར་མཛད་དེ།
en: So, with skillful means, the tathāgatas earlier cause these śrāvakas as worthy ones to eliminate all defilements, and then afterward connect them with the bodhisattva path.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པ་དོན་དམ་པའི་ཆོས་ཀྱི་དབང་ཕྱུག་རྣམས་ཀྱི་ཕྱིར་མི་ལྡོག་པའི་ཐབས་སོ།
en: This is the skillful means of the tathāgatas, the good Dharma lords, to make śrāvakas irreversible from awakening.

source: །ཇི་སྐད་དུ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པས་ཉན་ཐོས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་དེ་དག་ཇི་ལྟར་བལྟ་བར་བགྱི། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: It says: “Lord, how should we view the Tathāgata’s prediction of śrāvakas to unsurpassed, perfect, complete awakening?”

source: རིགས་ཀྱི་བུ་ངས་ཉན་ཐོས་རྣམས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ལུང་བསྟན་པ་གང་ཡིན་པ་དེ་དག་ནི་རིགས་ལས་བལྟས་ཏེ་ལུང་བསྟན་པའོ།
en: The Lord said, “My prediction of śrāvakas to unsurpassed, perfect, complete awakening is a prediction that has in view their lineage.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་ཉན་ཐོས་ཟག་པ་མ་མཆིས་པ། སྲིད་པ་ཀུན་ཏུ་སྦྱོར་བ་རྒྱུན་བཅད་པ་རྣམས་རིགས་མཆིས་སུ་ལགས་ཀྱང་ཇི་ལྟར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་བ་ལགས།
en: Lord, if even śrāvakas without outflows who have cut the fetters to suffering existence are in the lineage, how will they awaken to unsurpassed, perfect, complete awakening?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Lord said, “I will teach an illustration for that.

source: རིགས་ཀྱི་བུ་དེའི་ཕྱིར་དཔེ་བསྟན་གྱི་ཉོན་ཅིག །
en: Listen!

source: རིགས་ཀྱི་བུ་འདི་ལྟ་སྟེ། དཔེར་ན་རྒྱལ་པོ་རྒྱལ་རིགས་སྤྱི་བོ་ནས་དབང་བསྐུར་བ་ལ་བུ་ཞིག་ཡོད་དོ།
en: Child of a good family, a king who received the royal consecration on the crown of his head had a son.

source: དེ་ཡང་བཟོའི་གནས་ཐམས་ཅད་ལ་སློབ་པ་ལས་དབང་པོ་རྟུལ་ཞིང་། དབང་པོ་རྣོ་བ་མ་ཡིན་པས་དེ་ཕྱིས་བསླབ་པར་བྱ་བ་གང་ཡིན་པ་དེ་ནི་སྔར་སློབ།
en: He studied all the arts but had dull faculties, not sharp faculties, so he studied what you study later earlier, and studied later what you study earlier.

source: སྔར་བསླབ་པར་བྱ་བ་དེ་ནི་ཕྱིས་སློབ་པར་བྱེད་པས་ན་རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། ཅི་རྒྱུ་དེས་རྒྱལ་པོའི་བུ་མ་ཡིན་ཞེས་བྱའམ།
en: So, child of a good family, what do you think—is that boy, on account of that, not the son of the king?” “

source: གསོལ་པ། བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ། །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་ཏེ།
en: Not so, Lord; not so, Sugata,” he replied. “

source: བཅོམ་ལྡན་འདས་དེ་ལ་རྒྱལ་པོའི་བུ་ཉིད་ལགས་སོ་ཞེས་བགྱིའོ།
en: You still say of him that he is the king’s son.” “

source: །རིགས་ཀྱི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་དབང་པོ་རྟུལ་པོའི་རིགས་དང་ལྡན་པ་བསྒོམ་པའི་ལམ་གྱིས་སྔར་ཉོན་མོངས་པ་ཟད་པར་བྱས་ནས་ཕྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་ན།
en: In the same way, child of a good family, bodhisattvas in the lineage of those with dull faculties will earlier put an end to afflictions on the path of meditation, and later will fully awaken to unsurpassed, perfect, complete awakening.

source: རིགས་ཀྱི་བུ་དེ་ཇི་སྙམ་དུ་སེམས། རྒྱུ་དེས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་ཞེས་བྱའམ། གསོལ་པ།
en: What do you think, child of a good family, on account of that will they not have fully awakened?” “

source: བཅོམ་ལྡན་འདས་དེ་ནི་མ་ལགས་སོ།
en: Not so, Lord; not so, Sugata.”

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ་ཞེས་བྱ་བ་ལ་སོགས་པ་གསུངས་པ་ལྟ་བུའོ།
en: And so on.

source: །ཡང་ཇི་སྐད་དུ་བྱམས་པ་གང་ཐོག་མ་ཉིད་དུ་དམན་པའི་བྱེ་བྲག་དོན་དུ་གཉེར་ཏེ་དམན་པ་ཉིད་ཐོབ་ལ་དམན་པར་ཤེས་ནས་དེ་ཙམ་གྱིས་ཆོག་པར་མི་འཛིན་གྱི། དེའི་གོང་དུ་བཟང་པོའི་བྱེ་བྲག་ཉིད་ཚོལ་བས་བཟང་པོ་ཉིད་ཐོབ་པར་འགྱུར་བའི་རིགས་ཀྱི་བྱེ་བྲག་དེ་ལྟ་བུ་ཡང་ཡོད་དོ།
en: Again, it says: “Maitreya, there is one sort of family of beings, those who from the start strive for a superior qualification, who gain just the superior qualification; there is one sort of family of beings, those who from the start strive for an inferior qualification, who are satisfied by gaining just the inferior; and there is one sort of family of beings who from the start strive for an inferior qualification, gain the inferior, understand that it is lacking, are not satisfied just by that, and then strive for the superior qualification and gain the superior.”

source: །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་བྱམས་པས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་སེམས་ཅན་རྣམས་ཀྱི་རིགས་ཀྱི་རྣམ་པ་གསུམ་པོ་གང་ལགས་པ་དེ་དགྲ་བཅོམ་པ་ཉིད་ཐོབ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་དོན་དུ་གཉེར་ཀྱང་སྐྱེ་བ་མ་མཆིས་པར་ཇི་ལྟར་ཐོབ་པར་འགྱུར།
en: The Lord having said that, the bodhisattva asked him, “Lord, someone in the third family of beings, having reached the state of a worthy one, strives for unsurpassed, perfect, complete awakening but does not take rebirth, so how do they reach it?

source: སྐྱེ་བ་མ་མཆིས་པར་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་ངེས་པར་བཀའ་མ་སྩལ་ཏོ།
en: You have not said definitively, Lord, there is no rebirth.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། བྱམས་པ་དེའི་སྐྱེ་བ་ལས་དང་ཉོན་མོངས་པའི་དབང་གིས་འགྱུར་བར་ནི་མི་དོགས་ཀྱི། དེའི་སྐྱེ་བ་བསམ་གྱིས་མི་ཁྱབ་པ་དང་། སྤྲུལ་པ་དང་། ཡོངས་སུ་གྱུར་པའོ་ཞེས་ང་འདོགས་སོ་ཞེས་གསུངས་པ་ལྟ་བུའོ།
en: Maitreya,” replied the Lord, “I do not say that their rebirth is dictated by karma and afflictive emotion; I say that theirs is an inconceivable rebirth, magically created and dedicated.”

source: །གླེང་གཞིའི་ལེའུའོ།། །།
en: The Introduction Chapter.

source: བམ་པོ་བཞི་པ། ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བྱ་བ་ལ།
en: Summary of Contents “Here, Śāriputra, bodhisattva great beings who want to fully awaken to all dharmas in all forms should make an effort at the perfection of wisdom.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་བཤད་པ་ནི་བཅོམ་ལྡན་འདས་ཀྱིས་སྒོ་གསུམ་དང་། རྣམ་གྲངས་བཅུ་གཅིག་གིས་བཤད་པར་རྣམ་པར་གཞག་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ནི་མགོ་སྨོས་པས་གོ་བ་དང་།
en: In regard to this explanation of the perfection of wisdom, the Lord presents an exegesis by means of three gateways and eleven rounds of teaching.

source: རྣམ་པར་སྤྲོས་ན་གོ་བ་དང་། དྲང་དགོས་པའི་འདུལ་བ་རྣམ་པ་གསུམ་ལས་བརྩམས་ཏེ། མདོར་བསྟན་པའི་སྒོ་དང་། འབྲིང་དུ་བསྟན་པའི་སྒོ་དང་། རྒྱས་པར་བསྟན་པའི་སྒོ་དང་སྒོ་གསུམ་གྱིས་བཤད་དོ།
en: Taking three types of trainees as the point of departure—those who understand the perfection of wisdom by means of a brief indication, those who understand when there is an elaboration, and those who need to be led—it explains by means of the gateway of brief teaching, the gateway of intermediate teaching, and the gateway of detailed teaching.

source: །འདི་ལྟར་བཅོམ་ལྡན་འདས་ཀྱིས་གླེང་གཞིའི་ལེའུ་བསྟན་པའི་རིམ་པས་བརྩམས་པ་ཆེན་པོས་བཤད་པའི་སྐབས་ཕྱེ་སྟེ་ཆོས་བཤད་པའི་ཕྱིར་གནས་བརྟན་ཤཱ་རིའི་བུ་ལ།
en: Thus the Lord, by means of the sequence of teachings in the introduction chapter, and because it is a great undertaking, has set the stage for the explanation.

source: ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱའོ་ཞེས་བཀའ་སྩལ་ཏོ།
en: Then he says to the elder Śāriputra, “Here, Śāriputra, bodhisattva great beings who want to fully awaken to all dharmas in all forms should make an effort at the perfection of wisdom.”

source: །དེར་དེ་ཙམ་ཞིག་བཤད་ནས་ཅང་མི་གསུང་བར་གྱུར་ཏེ།
en: And having given just that explanation, he then falls completely silent.

source: དེ་བས་ན་འདི་ནི་མདོར་བསྟན་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཞེས་བྱའོ། །དེ་ལྟར་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བར་གྱུར་པ་དང་།
en: This is, therefore, “the perfection of wisdom taught in brief.”

source: གནས་བརྟན་ཤཱ་རིའི་བུས་རྣམ་པར་སྤྲོས་ན་གོ་བ་རྣམས་ཀྱི་དོན་ཞུ་བ་བརྩམས་ནས་འབྲིང་དུ་བསྟན་པའི་སྐབས་ཕྱེ་བ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་མངོན་པར་རྫོགས་པར་བྱང་ཆུབ་པར་འཚལ་བས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱི་ཞེས་གསོལ་ཏོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་མདོར་བསྟན་པའི་བཤད་པ་དེ་ཉིད་བཟུང་སྟེ། མདོར་བསྟན་པ་ཉིད་དུ་ཆོས་ཐམས་ཅད་བསྟན་ནས་སྤྱོད་པ་རྣམ་པ་བཞི་ཡང་བསྟན་ཏེ། དེའི་འོག་ཏུ་གང་གི་ཕྱིར་བརྩོན་པར་བྱ་བ་དང་། ཇི་ལྟར་བརྩོན་པར་བྱ་བ་དང་། བརྩོན་པར་བྱེད་པ་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་དང་། བརྩོན་པར་བྱེད་པ་རྣམས་ཀྱི་རབ་ཏུ་དབྱེ་བ་དང་།
en: As the Lord had fallen completely silent, so the elder Śāriputra, taking as his point of departure the welfare of those who understand when there is an elaboration, starts the intermediate teaching with the question, “How then, Lord, should bodhisattva great beings who want to fully awaken to all dharmas in all forms make an effort at the perfection of wisdom?”

source: བརྩོན་པ་ལ་གདམས་པ་གང་ཡིན་པ་དང་། བརྩོན་པའི་ཕན་ཡོན་གང་ཡིན་པ་དང་། བརྩོན་པའི་རབ་ཏུ་དབྱེ་བ་གང་ཡིན་པ་དང་། བཤད་པ་འདིའི་གཏན་ལ་དབབ་པ་གང་ཡིན་པ་དང་། རྣམ་པ་འདི་བརྒྱད་བསྟན་ཏོ།
en: Then the Lord, taking just that brief statement as his point of departure, teaching, in just that brief statement, all phenomena, and also teaching the four practices, gives an exposition in eight parts, concerning why bodhisattvas endeavor, how bodhisattvas endeavor, the defining marks of those who endeavor, the subdivisions of those who endeavor, the instructions for the endeavor, the benefits of the endeavor, the subdivisions of the endeavor, and the specific instruction for coming to an authoritative conclusion about this exposition.

source: །དེ་ལ་ཤཱ་རིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་གནས་པ་མེད་པའི་ཚུལ་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་ཏེ་ཞེས་བྱ་བ་ནས་བྱམས་པ་ཆེན་པོ་དང་སྙིང་རྗེ་ཆེན་པོ་དང་དགའ་བ་ཆེན་པོ་དང་བཏང་སྙོམས་ཆེན་པོ་བསྒོམ་པར་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་དཀར་པོའི་ཆོས་ཐམས་ཅད་བསྟན་པའོ།
en: Among these, it teaches all the wholesome dharmas, from “Śāriputra, here bodhisattva great beings, having stood in the perfection of wisdom by way of not taking their stand on it” up to “should cultivate great love, great compassion, great joy, and great equanimity.”

source: །དེའི་འོག་ཏུ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་རྣམ་པ་ཐམས་ཅད་ཀྱི་མཆོག་དང་ལྡན་པ། མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས་ཞེས་བྱ་བ་ནས་ཤཱ་རིའི་བུ་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར་འདོད་པའི་ཡོན་ཏན་ལྔ་ཉེ་བར་ལེན་ཏོ་ཞེས་བྱ་བའི་བར་ནི་གང་གི་ཕྱིར་བརྩོན་པར་བྱ་ཞེས་བྱ་བ་དེའི་བཤད་པའོ།
en: Then, from “who want to fully awaken to the knowledge, furnished with the best of all aspects, of a knower of all aspects,” up to “So, Śāriputra, bodhisattva great beings take to these sorts of sense objects in order to bring beings to maturity,” is the explanation of why bodhisattvas endeavor.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བགྱི་ཞེས་བྱ་བ་ནས་ཡན་ལག་བརྒྱད་དང་ལྡན་པའི་གསོ་སྦྱོང་དང་།
en: Then, from, “Lord, how then should bodhisattva great beings practice the perfection of wisdom?”

source: བསམ་གཏན་བཞི་ནས་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅོ་བརྒྱད་སྦྱིན་པར་བྱེད་པའོ་ཞེས་བྱ་བའི་བར་དུ་ནི་ཇི་ལྟར་བརྩོན་པར་བྱ་ཞེས་བྱ་བ་དེའི་བཤད་པའོ།
en: and from “a giver of… the eight-branched confession and restoration,” and from “the four concentrations,” up to “the eighteen distinct attributes of a buddha” is the explanation of how bodhisattvas endeavor.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བགྱིས་ན་བརྩོན་ཞེས་བགྱི་བ་ལགས་ཞེས་བྱ་བ་ནས་འཆལ་བའི་ཚུལ་ཁྲིམས་ཀྱི་སེམས་དང་།
en: Then, from, “Lord, how are bodhisattva great beings who engage with the perfection of wisdom ‘engaged’?”

source: ལེ་ལོའི་སེམས་དང་། རྣམ་པར་གཡེང་བའི་སེམས་དང་། འཆལ་པའི་ཤེས་རབ་ཀྱི་སེམས་མི་བསྐྱེད་དོ་ཞེས་བྱ་བའི་བར་དུ་ནི་བརྩོན་པར་བྱེད་པ་རྣམས་ཀྱི་མཚན་ཉིད་གང་ཡིན་པ་ཞེས་བྱ་བ་དེ་བཤད་པའོ།
en: up to “do not produce an immoral thought, [a malicious thought,] a lazy thought, a distracted thought, or an intellectually confused thought” is the explanation of the defining marks of those who endeavor.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གནས་པ་འདིས་གནས་པ་དེ་གང་ནས་ཤི་འཕོས་ཏེ་འདིར་སྐྱེས་པ་ལགས་ཞེས་བྱ་བ་ནས་སྲོག་ཆགས་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་སངས་རྒྱས་སུ་ལུང་བསྟན་པའི་བར་ནི་བརྩོན་པར་བྱེད་པ་རྣམས་ཀྱི་རབ་ཏུ་དབྱེ་བ་བཤད་པའོ།
en: Then, from, “Where did they die, Lord, bodhisattva great beings dwelling by means of this yogic practice of the perfection of wisdom who have taken birth here?” up to where it predicts the awakening of “a hundred thousand one hundred million billion beings” is the explanation of the subdivisions of those who endeavor.

source: །དེའི་འོག་ཏུ་རབ་འབྱོར་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྩོམ་སྟེ། ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ངེས་པར་འབྱུང་བར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱི་གཏམ་བྱ་བར་སྤོབས་པར་གྱིས་ཤིག་ཅེས་བྱ་བ་ནས་འདི་ཉིད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་གདམས་པ་ཡིན་ཏེ། འདི་ཉིད་རྗེས་སུ་བསྟན་པ་ཡིན་ནོ་ཞེས་བྱ་བའི་བར་དུ་ནི་བརྩོན་པ་ལ་གདམས་པ་བསྟན་པའོ།
en: Then, from, “Subhūti, starting with the perfection of wisdom, be confident in your readiness to give a Dharma discourse to the bodhisattva great beings about how bodhisattva great beings go forth in the perfection of wisdom,” up to “just that is the advice about the perfection of wisdom of bodhisattvas, just that is the instruction,” teaches the instructions for the endeavor.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་གཟུགས་ཡོངས་སུ་རྟོགས་པར་འཚལ་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱིའོ་ཞེས་བྱ་བ་ནས། འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་དང་། བྱང་ཆུབ་སེམས་དཔའ་དང་། སངས་རྒྱས་ཀྱི་ས་གང་དག་ལ་བསླབ་པར་བྱ་བའི་ཐེག་པ་གསུམ་པོ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་ལས་རྒྱ་ཆེར་བསྟན་ཏོ་ཞེས་བྱ་བའི་བར་དུ་ནི་བརྩོན་པའི་ཕན་ཡོན་བསྟན་པའོ།
en: Then, from, “Lord, bodhisattva great beings who want to comprehend form should train in the perfection of wisdom,” up to “because in this perfection of wisdom is detailed instruction for the three vehicles in which bodhisattva great beings should train on the level of śrāvakas and pratyekabuddhas, bodhisattvas, and buddhas,” teaches the benefits of the endeavor.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་བདག་གིས་བྱང་ཆུབ་སེམས་དཔའ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མ་འཚལ་མ་དམིགས་ཏེ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ཞེས་བྱ་བ་ནས། རབ་འབྱོར་འདི་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་སྡིག་པའི་གྲོགས་པོར་རིག་པར་བྱ་སྟེ་རིག་ནས་ཀྱང་ཡོངས་སུ་སྤང་བར་བྱའོ་ཞེས་བྱ་བའི་བར་དུ་ནི། བརྩོན་པའི་རབ་ཏུ་དབྱེ་བ་བསྟན་པའོ།
en: Then, from, “Lord, given that I do not find, do not apprehend, and do not see a bodhisattva or the perfection of wisdom,” up to “someone who does not teach and explain to them that such things as those are works of Māra, Subhūti, they should know is a bad friend of a bodhisattva great being, and knowing that, should shun them,” teaches the subdivisions of the endeavor.

source: །དེའི་འོག་ཏུ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཞེས་བགྱི་ན།
en: Then, from, “Lord, you say ‘bodhisattva great being.’

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་ཞེས་བགྱི་བའི་ཚིག་གི་དོན་གང་ལགས་ཞེས་བྱ་བ་ནས།
en: What is the meaning of the term?”

source: ལྷའི་དབང་པོས་ཞུས་པའི་བར་དུ་ནི་དྲི་བ་ཉི་ཤུ་རྩ་བརྒྱད་བརྩམས་ནས་གནས་བརྟན་གཉིས་ཀྱིས་དྲིས་པ་དང་། ལན་བཏབ་པའི་རིམ་པས་མདོར་བཤད་པ་འདིའི་ཚིག་གི་དོན་དང་མཚན་ཉིད་ཀྱིས་གཏན་ལ་དབབ་པ་རྣམ་པ་གཉིས་སུ་བསྟན་ཏེ།
en: up to the questions of the chief of the gods, starting with twenty-eight questions and then the series of questions and responses by the two elders, is the two-part specific instruction for coming to an authoritative conclusion about this brief exposition in terms of the meaning of the words and the characteristic marks.

source: དེ་ལྟར་རིམ་པ་འདིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འབྲིང་དུ་བཤད་པ་ཡོངས་སུ་རྫོགས་པར་བྱས་སོ།
en: Thus, the intermediate explanation of the perfection of wisdom is completed in these stages.

source: །འབྲིང་དུ་བསྟན་པ་འདི་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་ཏེ་རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་བཟུང་ནས་དོན་དམ་པའི་བདེན་པའི་ཚུལ་དུ་བཤད་དོ།
en: This intermediate teaching, furthermore, is an explanation in ultimate truth mode that takes as its point of departure the knowledge of all aspects, that is, the state of the nonconceptual perfection of wisdom.

source: །དེའི་འོག་ཏུ་རྒྱས་པར་བཤད་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའི་ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་ལས་བརྩམས་ཏེ་རྣམ་པར་རྟོག་པ་དང་བཅས་པ་དང་། རྣམ་པར་མི་རྟོག་པའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཟུང་ནས་དྲང་དགོས་པ་རྣམས་ཀྱི་དོན་དུ་ཀུན་རྫོབ་དང་། དོན་དམ་པའི་དབང་གིས་རྣམ་པ་གཉིས་སུ་རྒྱས་པར་བཤད་དོ།
en: Then, the detailed explanation, starting with the knowledge of all aspects of the bodhisattva’s path that takes the conceptual and nonconceptual perfection of wisdom as its point of departure, gives a detailed explanation in two parts, governed by the conventional and ultimate, for the sake of those who need to be led.

source: །དེའི་{གོ་རིམས་,གོ་རིམ་}ནི་འོག་ནས་དེ་ཉིད་ཀྱི་སྐབས་ནས་བསྟན་ཏོ།
en: The teaching of the sequence of these is given below in the specific appropriate contexts. Then there are the “eleven rounds” of teaching.

source: །དེ་ནས་རྣམ་གྲངས་བཅུ་གཅིག་ཅེས་བྱ་བ་ནི་དང་པོར་ཤཱ་རིའི་བུ་ལ་བཀའ་སྩལ་ཏེ་བཤད་པ་ནི་རྣམ་གྲངས་གཅིག་གོ། །དེའི་འོག་ཏུ་གནས་བརྟན་རབ་འབྱོར་གྱིས་རྒྱས་པར་བཤད་པ་ནི་གཉིས་པའོ། །དེ་ནས་བརྒྱ་བྱིན་ལ་བཀའ་སྩལ་པ་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་དང་། དེ་ནས་འཕགས་པ་བྱམས་པ་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་དང་། དེ་ནས་བརྒྱ་བྱིན་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་དང་། དེ་ནས་བྱམས་པ་དང་། དེ་ནས་གནས་བརྟན་རབ་འབྱོར་ལ་བཀའ་སྩལ་ཏེ། རྟག་ཏུ་ངུ་དང་། ཆོས་འཕགས་ཀྱི་གཏམ་གྱིས་ཡང་གནས་བརྟན་ཀུན་དགའ་བོ་ལ་བཀའ་སྩལ་ནས་ཡོངས་སུ་གཏད་པ་སྟེ།
en: These eleven rounds of teaching are: the first round in which an explanation is addressed to Śāriputra; the second, a detailed explanation by the elder Subhūti;then the address to Śatakratu, then to elder Subhūti; then to the noble Maitreya, then to the elder Subhūti,then to Śatakratu, then to the elder Subhūti,then to Maitreya, then to the venerable Subhūti;and with the story of Sadāprarudita and Dharmodgata, the entrusting of the sūtra to venerable Ānanda.
